[
  {
    "Event ID": "A1",
    "Date": "26/1/26",
    "Arrive Time": "7:00:00 PM",
    "Start Time": "7:00:00 PM",
    "End Time": "9:30:00 PM",
    "Venue": "The Angel",
    "Address": "73 City Road",
    "City": "London",
    "Postcode": "EC1Y 1BD",
    "Speaker": "Sara Mastros",
    "Speaker Bio": "",
    "Speaker Website": "www.WitchLessons.com",
    "Talk Title": "Grandmother Winter's House of Healing : A Trance Journey for Witches",
    "Talk Blurb": "Join us at Nova Stella for a mystical journey into Grandmother Winter's House of Healing : A Trance Journey for Witches\nWe are absolutely delighted and thrilled to be able to say that our first speaker of 2026 on Monday the 26th January at the Angel Pub in Shoreditch will be none other than Sara Mastros. The talk will be on: \"\"Grandmother Winter's House of Healing: A Trance Journey for Witches\"\".\nSara L. Mastros is the author of “Introduction to Witchcraft: Thirteen Lessons in the Practice of Magic,\"\" The Sorcery of Solomon: A Guide to the 44 Planetary Pentacles of the Magician King\"\", “The Big Book of Magical Incense\"\", and \"\"Orphic Hymns Grimoire.”\nRecognized by her peers as a brilliant and original thinker, an engaging and inspiring teacher, a compelling and clever writer, and a generally decent human being, Sara spends a lot of time dreaming, thinking, enchanting, writing, and teaching about witchcraft, magic, and myth. But, her true passion is raising up an army of inspired, educated, empowered witches prepared to weave weird new ways of Being in a world that desperately needs us. Rise up! [www.WitchLessons.com]\nAfter her talk for Nova Stella, Sara will be pleased to sign copies of her works should you wish to bring them along!",
    "Online Eventbrite Link": "https://www.eventbrite.com/e/online-tickets-only-sara-l-mastros-at-nova-stella-tickets-1979299899280?aff=oddtdtcreator&fbclid=IwY2xjawPXZDBleHRuA2FlbQIxMABicmlkETBlbDBJUmpENkJZTDJVZjNXc3J0YwZhcHBfaWQQMjIyMDM5MTc4ODIwMDg5MgABHv-mKGAQ0cyQ2NhToPAeESyGEyW4MX4aCe990pQDhWNJjUjSoY3PMht6jDoe_aem_3_vJRvQGdCZBB0A9PKdCLA",
    "In Person Eventbrite Link": "https://www.eventbrite.com/e/sara-l-mastros-at-nova-stella-grandmother-winters-house-of-healing-tickets-1978850172134?aff=erelpanelorg#location"
  }
]